#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/kelton-org/learn-terraform-cloud/runs/run-QeGKj4Byn1s1PG3R

Waiting for the plan to start...

Terraform v1.4.0
on linux_amd64
Initializing plugins and modules...
module.vm_compute_instance.data.google_compute_zones.available: Refreshing...
module.vm_compute_instance.data.google_compute_zones.available: Refresh complete after 0s [id=projects/vibrant-climber-324821/regions/us-central1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "terraform-network"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.vm_compute_instance.google_compute_instance_from_template.compute_instance[0] will be created
  + resource "google_compute_instance_from_template" "compute_instance" {
      + allow_stopping_for_update = (known after apply)
      + attached_disk             = (known after apply)
      + can_ip_forward            = (known after apply)
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + description               = (known after apply)
      + desired_status            = (known after apply)
      + enable_display            = (known after apply)
      + guest_accelerator         = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + labels                    = (known after apply)
      + machine_type              = (known after apply)
      + metadata                  = (known after apply)
      + metadata_fingerprint      = (known after apply)
      + metadata_startup_script   = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "module_instance-001"
      + project                   = (known after apply)
      + resource_policies         = []
      + scratch_disk              = (known after apply)
      + self_link                 = (known after apply)
      + service_account           = (known after apply)
      + source_instance_template  = "my-first-template"
      + tags                      = (known after apply)
      + tags_fingerprint          = (known after apply)
      + zone                      = "us-central1-a"

      + network_interface {
          + access_config      = (known after apply)
          + alias_ip_range     = (known after apply)
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "terraform-network"
          + network_ip         = (known after apply)
          + nic_type           = (known after apply)
          + queue_count        = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork_project = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @keljerel, Action: `pull_request`*